app/controllers/school_classes_controller.rb

  def create
    # two word names
    @schoolclass = SchoolClass.create(params.require(:school_class).permit(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Arithmetic"], ["room_number", 32], ["created_at", "2019-08-04 19:05:17.260208"], ["updated_at", "2019-08-04 19:05:17.260208"]]

  def update
    @schoolclass = SchoolClass.find(params[:id])
    @schoolclass.update(params.require(:school_class).permit(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", "10"], ["updated_at", "2019-07-23 20:29:19.133306"], ["id", 1]]