app/controllers/students_controller.rb

  def update
    find_student
    @student.update(params.require(:student).permit(:first_name, :last_name))
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Malisa"], ["last_name", "Middlebrooks"], ["updated_at", "2019-08-04 19:18:03.936192"], ["id", 3]]